project-three/app/views/users/_nav.html.erb

	<div style="display:inline-block">
		Hi, <%= User.find(session['user_id']).first_name.capitalize %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]