app/views/recommendations/show.html.erb

		<% elsif @recommendation.social_media == 'Twitter' %>
			<%= $twitter.user_timeline(@recommendation.handle).first.text %>
---
SELECT "users".* FROM "users"


		<h3>Sent to <%= link_to @users.find(@recommendation.user_id_to).first_name.capitalize, public_recommendations_path(@recommendation.user_id_to) %> from <%= link_to @recommendation.user.first_name.capitalize, public_recommendations_path(@recommendation.user.id) %></h3>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]