project-three/app/views/recommendations/_nav.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
	<div style="display:inline-block">
		Currently logged in as <%= User.find(session['user_id']).first_name.capitalize %>