project-three/app/views/recommendations/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
					<td>
						<%= link_to rec.user.first_name.capitalize, public_recommendations_path(rec.user.id) %><br>