project-three/app/views/recommendations/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
			<tr>
				<td><%= rec.user.first_name %></td>