project-three/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "brooke@brooke.com"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
	def create
		#find the user by their email
		user = User.where(email: params[:user][:email]).first
		if user != nil && user.authenticate(params[:user][:password])
			session['user_id'] = user.id.to_s #Session is built-in to Rails; it's like a cookie
			@current_user = User.find(session['user_id'])