project-three/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "twitter" = $1, "instagram" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["twitter", "brookekfox"], ["instagram", "foxbrooke"], ["updated_at", "2015-03-11 03:29:29.475383"], ["id", 1]]
---
	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params.require(:user).permit(:first_name, :last_name, :email, :twitter, :instagram, :password, :password_confirmation, :avatar))