app/controllers/recommendations_controller.rb

SELECT "users".* FROM "users"
SELECT "recommendations".* FROM "recommendations"
---
  def index
		@users = User.all
		@recommendations = Recommendation.all.order(params[:sort])

SELECT "recommendations".* FROM "recommendations" WHERE "recommendations"."user_id" = $1  [["user_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
	def public
		# @recommendations = Recommendation.all
		@recommendations = Recommendation.all.where(user_id:params[:id]).order(params[:sort])
		@user = User.find(params[:id])

INSERT INTO "recommendations" ("social_media", "is_private", "handle", "user_id_to", "user_id", "is_funny", "is_food", "is_news", "is_fashion", "is_sports", "is_tv", "is_film", "is_music", "is_blog", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
	def create
		@recommendation = Recommendation.create(recommendation_params)

SELECT "users".* FROM "users"
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT 1  [["id", 18]]
---
  def show
		@users = User.all
		@recommendation = Recommendation.find(params[:id])