app/controllers/sessions_controller.rb

	def create
		user = User.where(email: params[:user][:email]).first
		if user != nil && user.authenticate(params[:user][:password])
			session['user_id']   = user.id.to_s
			session['user_type'] = 'logged-in'
			session['user_name'] = user.first_name
			@current_user = User.find(session['user_id'])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "brooke@brooke.com"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]